Autodesk.Revit.DB.ScheduleFieldType.Sheets
A parameter of the sheet view owning an annotation element (e.g. Revision Cloud)

Autodesk.Revit.DB.ScheduleFieldType.Views
A parameter of the primary view owning an annotation element (e.g. Revision Cloud)

Autodesk.Revit.DB.ScheduleFieldType.Revision
A parameter of the revision element that the scheduled revision cloud element belongs to.

Autodesk.Revit.DB.ScheduleFieldType.CustomField
For this field type the value for each row is computed based on the (sub)elements that are grouped on that row
and can have a graphic representation when the schedule is placed on a sheet.

Autodesk.Revit.DB.ScheduleFieldType.HostCount
Counts the number of hosts with different mark.